# Урок 01
# #######

# Это код файла на языке python, каждая строчка этого файла - это приказ совершить определенное действие
# В коде python файла все, что после символа # считается комментарием и игнорируется компилятором
# то есть таким образом можно оставлять пояснения к коду и выключать ненужные строчки, не удаляя их

# Переменные - это области памяти компьютера, в которых хранятся данные разного рода.
# Переменную можно представить как подписанную коробку, в которой лежит что то.
# Так как мы работаем с данными, это что то может быть буквой, словом, строкой, числом, набором чисел и т.д.
# Задав значение переменной один раз, мы можем использовать это значение далее, вызывая по имени эту переменную.
# Если в переменную положить новое значение, старое сотрется и запишется новое, поэтому переменная так и называется,
# потому что ее содержимое может меняться.


# Переменные в python объявляются следующим образом
# имя_переменной = значение_переменной
# То есть, написав x = 2 мы задаем переменную с именем х и значением 2, иными словами,
# в коробку с именем x кладем кусочек данных в виде числа 2

x = 2

# print() это функция, конструкция, которая распечатывает все, что в нее передашь, на экран
# Можно распечатать одно значение
print(x)  # это напечатает - 2

# А можно несколько сразу, через запятую
print('x: ', x)  # а тут уже напишет x: 2

# перезапишем переменную х и распечатаем ее снова
x = 777
print('x: ', x)  # и тут уже напишет х: 777

# исходя из того, что мы в переменную засунем, она примет тип своего содержимого
# если записать в переменную слово - она будет с типом string (строка)
# если записать число 25 - то тип будет integer (целое число)
# если дробное число 3.14 - то тип будет float (десятичная дробь)

# Строки мы записываем так
my_name = "Ilyar"  # можно использовать двойные кавычки "
hi = 'Hello'  # a можно и одинарные '
x_str = '100'  # еще строка
x_int = 100  # а это уже целое число - integer
y_int = 200  # и еще одно

# строки в питоне можно склеивать с помощью + (называется конкатенация строк)
welcome = hi + my_name  # склеим две переменные со строками и присвоим результат склеивания переменной welcome
print(welcome)  # напечатает HelloAlexei
welcome = hi + ' ' + my_name  # добавим туда еще и строку с пробелом
print(welcome)  # напечатает Hello Alexei

# если мы используем оператор + на числовых типах (integer или float) то выполнится арифметическая операция сложения
print('Прибавим x_int к y_int: ', x_int + y_int)  # выведет 300 - сумму чисел, в переменных x_int и y_int

# А что если мы прибавим x_str к x_int?
# print(x_str + x_int)
# Если мы раскомментируем строку выше, то компилятор выдаст ошибку
# Потому что x_str имеет тип string, а x_int - это integer, а операция + работает с переменными с
# одинаковыми типами.
# Но мы можем преобразовывать типы используя следующие функции:
str()  # чтобы преобразовать в строку
int()  # в целое число
float()  # в дробное
print(x_str + str(x_int))  # тут мы превратили число в строку и результатом принта будет 100100
print(int(x_str) + x_int)  # тут мы превратили число в строку и результатом принта будет 200
print(float(y_int))  # а тут 200.0, что показывает что это дробное число

# чтобы запросить что нибудь у пользователя, используется функция input()
user_input = input('Введите что нибудь: ')
# На этом месте исполнение программы останавливается и она ожидает
# ввода от пользователя, чтобы записать потом полученное в переменную user_input
print('Вы ввели - ', user_input)  # распечатаем то, что ввели

# Теперь мы имеем понятие о том, что такое переменные, как присвоить им значения, как их распечатать на экран,
# как поменять тип переменной, как записать в переменную ввод от пользователя

# п.з. : составить программу, запрашивающую возраст пользователя и выводящую
# ему его дату рождения, используя инфу выше и следующий алгоритм действий:
# - запросить у пользователя его возраст и записать в переменную
# - отнять от текущего года полученный год, сначала преобразовав полученный тип в число
# - вывести результат на экран
